yeashen/raspberry-stm32/src/mpu6050.h
//// I2C_MST_STATUS register
//u8 mpu6050_getPassthroughStatus();
//u8 mpu6050_getSlave4IsDone();
//u8 mpu6050_getLostArbitration();
//u8 mpu6050_getSlave4Nack();
//u8 mpu6050_getSlave3Nack();
//u8 mpu6050_getSlave2Nack();
//u8 mpu6050_getSlave1Nack();
//u8 mpu6050_getSlave0Nack();

//// INT_PIN_CFG register
//u8 mpu6050_getInterruptMode();
//void mpu6050_setInterruptMode(u8 mode);
//u8 mpu6050_getInterruptDrive();
//void mpu6050_setInterruptDrive(u8 drive);
//u8 mpu6050_getInterruptLatch();
//void mpu6050_setInterruptLatch(u8 latch);
//u8 mpu6050_getInterruptLatchClear();
//void mpu6050_setInterruptLatchClear(u8 clear);
//u8 mpu6050_getFSyncInterruptLevel();
//void mpu6050_setFSyncInterruptLevel(u8 level);
//u8 mpu6050_getFSyncInterruptEnabled();
//void mpu6050_setFSyncInterruptEnabled(u8 enabled);
u8 mpu6050_getI2CBypassEnabled(void);
void mpu6050_setI2CBypassEnabled(u8 enabled);
//u8 mpu6050_getClockOutputEnabled();
//void mpu6050_setClockOutputEnabled(u8 enabled);

//// INT_ENABLE register
//u8 mpu6050_getIntFreefallEnabled();
//void mpu6050_setIntFreefallEnabled(u8 enabled);
//u8 mpu6050_getIntMotionEnabled();
//void mpu6050_setIntMotionEnabled(u8 enabled);
//u8 mpu6050_getIntZeroMotionEnabled();
//void mpu6050_setIntZeroMotionEnabled(u8 enabled);
//u8 mpu6050_getIntFIFOBufferOverflowEnabled();
//void mpu6050_setIntFIFOBufferOverflowEnabled(u8 enabled);
//u8 mpu6050_getIntI2CMasterEnabled();
//void mpu6050_setIntI2CMasterEnabled(u8 enabled);
//u8 mpu6050_getIntDataReadyEnabled();
//void mpu6050_setIntDataReadyEnabled(u8 enabled);

//// INT_STATUS register
//u8 mpu6050_getIntFreefallStatus();
//u8 mpu6050_getIntMotionStatus();
//u8 mpu6050_getIntZeroMotionStatus();
//u8 mpu6050_getIntFIFOBufferOverflowStatus();
//u8 mpu6050_getIntI2CMasterStatus();
//u8 mpu6050_getIntDataReadyStatus();

//// ACCEL_*OUT_* registers
void mpu6050_getMotion9(int16_t* ax, int16_t* ay, int16_t* az, int16_t* gx, int16_t* gy, int16_t* gz, int16_t* mx, int16_t* my, int16_t* mz);
void mpu6050_getMotion6(int16_t* ax, int16_t* ay, int16_t* az, int16_t* gx, int16_t* gy, int16_t* gz);
void mpu6050_getAcceleration(int16_t* x, int16_t* y, int16_t* z);
int16_t mpu6050_getAccelerationX(void);
int16_t mpu6050_getAccelerationY(void);
int16_t mpu6050_getAccelerationZ(void);

//// TEMP_OUT_* registers
int16_t mpu6050_getTemperature(void);

//// GYRO_*OUT_* registers
void mpu6050_getRotation(int16_t* x, int16_t* y, int16_t* z);
int16_t mpu6050_getRotationX(void);
int16_t mpu6050_getRotationY(void);
int16_t mpu6050_getRotationZ(void);

//// EXT_SENS_DATA_* registers
//uint8_t mpu6050_getExternalSensorByte(int position);
//uint16_t mpu6050_getExternalSensorWord(int position);
//uint32_t mpu6050_getExternalSensorDWord(int position);

//// MOT_DETECT_STATUS register
//u8 mpu6050_getXNegMotionDetected();
//u8 mpu6050_getXPosMotionDetected();
//u8 mpu6050_getYNegMotionDetected();
//u8 mpu6050_getYPosMotionDetected();
//u8 mpu6050_getZNegMotionDetected();
//u8 mpu6050_getZPosMotionDetected();
//u8 mpu6050_getZeroMotionDetected();

//// I2C_SLV*_DO register
//void mpu6050_setSlaveOutputByte(uint8_t num, uint8_t data);

//// I2C_MST_DELAY_CTRL register
//u8 mpu6050_getExternalShadowDelayEnabled();
//void mpu6050_setExternalShadowDelayEnabled(u8 enabled);
//u8 mpu6050_getSlaveDelayEnabled(uint8_t num);
//void mpu6050_setSlaveDelayEnabled(uint8_t num, u8 enabled);

//// SIGNAL_PATH_RESET register
//void mpu6050_resetGyroscopePath();
//void mpu6050_resetAccelerometerPath();
//void mpu6050_resetTemperaturePath();

//// MOT_DETECT_CTRL register
//uint8_t mpu6050_getAccelerometerPowerOnDelay();
//void mpu6050_setAccelerometerPowerOnDelay(uint8_t delay);
//uint8_t mpu6050_getFreefallDetectionCounterDecrement();
//void mpu6050_setFreefallDetectionCounterDecrement(uint8_t decrement);
//uint8_t mpu6050_getMotionDetectionCounterDecrement();
//void mpu6050_setMotionDetectionCounterDecrement(uint8_t decrement);

//// USER_CTRL register
//u8 mpu6050_getFIFOEnabled();
//void mpu6050_setFIFOEnabled(u8 enabled);
u8 mpu6050_getI2CMasterModeEnabled(void);
void mpu6050_setI2CMasterModeEnabled(u8 enabled);
//void mpu6050_switchSPIEnabled(u8 enabled);
//void mpu6050_resetFIFO();
//void mpu6050_resetI2CMaster();
//void mpu6050_resetSensors();

//// PWR_MGMT_1 register
//void mpu6050_reset();
//u8 mpu6050_getSleepEnabled();
void mpu6050_setSleepEnabled(u8 enabled);
//u8 mpu6050_getWakeCycleEnabled();
//void mpu6050_setWakeCycleEnabled(u8 enabled);
//u8 mpu6050_getTempSensorEnabled();
//void mpu6050_setTempSensorEnabled(u8 enabled);
uint8_t mpu6050_getClockSource(void);
void mpu6050_setClockSource(uint8_t source);

//// PWR_MGMT_2 register
//uint8_t mpu6050_getWakeFrequency();
//void mpu6050_setWakeFrequency(uint8_t frequency);
//u8 mpu6050_getStandbyXAccelEnabled();
//void mpu6050_setStandbyXAccelEnabled(u8 enabled);
//u8 mpu6050_getStandbyYAccelEnabled();
//void mpu6050_setStandbyYAccelEnabled(u8 enabled);
//u8 mpu6050_getStandbyZAccelEnabled();
//void mpu6050_setStandbyZAccelEnabled(u8 enabled);
//u8 mpu6050_getStandbyXGyroEnabled();
//void mpu6050_setStandbyXGyroEnabled(u8 enabled);
//u8 mpu6050_getStandbyYGyroEnabled();
//void mpu6050_setStandbyYGyroEnabled(u8 enabled);
//u8 mpu6050_getStandbyZGyroEnabled();
//void mpu6050_setStandbyZGyroEnabled(u8 enabled);

//// FIFO_COUNT_* registers
//uint16_t mpu6050_getFIFOCount();

//// FIFO_R_W register
//uint8_t mpu6050_getFIFOByte();
//void mpu6050_setFIFOByte(uint8_t data);

//// WHO_AM_I register
//uint8_t mpu6050_getDeviceID();
//void mpu6050_setDeviceID(uint8_t id);

//// ======== UNDOCUMENTED/DMP REGISTERS/METHODS ========

//// XG_OFFS_TC register
//int8_t mpu6050_getXGyroOffset();
//void mpu6050_setXGyroOffset(int8_t offset);

//// YG_OFFS_TC register
//int8_t mpu6050_getYGyroOffset();
//void mpu6050_setYGyroOffset(int8_t offset);

//// ZG_OFFS_TC register
//int8_t mpu6050_getZGyroOffset();
//void mpu6050_setZGyroOffset(int8_t offset);

//// X_FINE_GAIN register
//int8_t mpu6050_getXFineGain();
//void mpu6050_setXFineGain(int8_t gain);

