yeashen/raspberry-stm32/src/mpu6050.h
//// Y_FINE_GAIN register
//int8_t mpu6050_getYFineGain();
//void mpu6050_setYFineGain(int8_t gain);

//// Z_FINE_GAIN register
//int8_t mpu6050_getZFineGain();
//void mpu6050_setZFineGain(int8_t gain);

//// XA_OFFS_* registers
//int16_t mpu6050_getXAccelOffset();
//void mpu6050_setXAccelOffset(int16_t offset);

//// YA_OFFS_* register
//int16_t mpu6050_getYAccelOffset();
//void mpu6050_setYAccelOffset(int16_t offset);

//// ZA_OFFS_* register
//int16_t mpu6050_getZAccelOffset();
//void mpu6050_setZAccelOffset(int16_t offset);

//// XG_OFFS_USR* registers
//int16_t mpu6050_getXGyroOffsetUser();
//void mpu6050_setXGyroOffsetUser(int16_t offset);

//// YG_OFFS_USR* register
//int16_t mpu6050_getYGyroOffsetUser();
//void mpu6050_setYGyroOffsetUser(int16_t offset);

//// ZG_OFFS_USR* register
//int16_t mpu6050_getZGyroOffsetUser();
//void mpu6050_setZGyroOffsetUser(int16_t offset);

//// INT_ENABLE register (DMP functions)
//u8 mpu6050_getIntPLLReadyEnabled();
//void mpu6050_setIntPLLReadyEnabled(u8 enabled);
//u8 mpu6050_getIntDMPEnabled();
//void mpu6050_setIntDMPEnabled(u8 enabled);

//// DMP_INT_STATUS
//u8 mpu6050_getDMPInt5Status();
//u8 mpu6050_getDMPInt4Status();
//u8 mpu6050_getDMPInt3Status();
//u8 mpu6050_getDMPInt2Status();
//u8 mpu6050_getDMPInt1Status();
//u8 mpu6050_getDMPInt0Status();

//// INT_STATUS register (DMP functions)
//u8 mpu6050_getIntPLLReadyStatus();
//u8 mpu6050_getIntDMPStatus();

//// USER_CTRL register (DMP functions)
//u8 mpu6050_getDMPEnabled();
//void mpu6050_setDMPEnabled(u8 enabled);
//void mpu6050_resetDMP();

//// BANK_SEL register
//void mpu6050_setMemoryBank(uint8_t bank, u8 prefetchEnabled, u8 userBank);

//// MEM_START_ADDR register
//void mpu6050_setMemoryStartAddress(uint8_t address);

//// MEM_R_W register
//uint8_t mpu6050_readMemoryByte();
//void mpu6050_writeMemoryByte(uint8_t data);
//void mpu6050_readMemoryBlock(uint8_t *data, uint16_t dataSize, uint8_t bank, uint8_t address);
//u8 mpu6050_writeMemoryBlock(uint8_t *data, uint16_t dataSize, uint8_t bank, uint8_t address, u8 verify, u8 useProgMem);
//u8 mpu6050_writeProgMemoryBlock(uint8_t *data, uint16_t dataSize, uint8_t bank, uint8_t address, u8 verify);

//// DMP_CFG_1 register
//uint8_t mpu6050_getDMPConfig1();
//void mpu6050_setDMPConfig1(uint8_t config);

//// DMP_CFG_2 register
//uint8_t mpu6050_getDMPConfig2();
//void mpu6050_setDMPConfig2(uint8_t config);

#ifdef __cplusplus
}
#endif

#endif /* __MPU6050_H */
